* beginner

#+NAME: jig-michigan-under-mirror
#+BEGIN_SRC ipython :session :results output drawer

#+END_SRC


#+NAME: romeo-paris-mississippi-glucose
#+BEGIN_SRC ipython :session :results output drawer
from pycse.beginner import *
a = [1, 2, 3, 4, 5]
print([first(a), second(a), third(a), fourth(a), fifth(a)])
#+END_SRC

#+RESULTS: romeo-paris-mississippi-glucose
:RESULTS:
[1, 2, 3, 4, 5]
:END:


#+NAME: jersey-mars-summer-dakota
#+BEGIN_SRC ipython :session :results value drawer
butlast(a)
#+END_SRC

#+RESULTS: jersey-mars-summer-dakota
:RESULTS:
[1, 2, 3, 4]
:END:

#+NAME: monkey-failed-west-seventeen
#+BEGIN_SRC ipython :session :results value drawer
last(a)
#+END_SRC

#+RESULTS: monkey-failed-west-seventeen
:RESULTS:
5
:END:

#+NAME: fruit-idaho-floor-robert
#+BEGIN_SRC ipython :session :results output drawer
rest(a)
#+END_SRC

#+RESULTS: fruit-idaho-floor-robert
:RESULTS:
[2, 3, 4, 5]
:END:

#+NAME: hotel-fanta-artist-pasta
#+BEGIN_SRC ipython :session :results value drawer
[nth(a, i) for i in range(5)]
#+END_SRC

#+RESULTS: hotel-fanta-artist-pasta
:RESULTS:
[1, 2, 3, 4, 5]
:END:

#+NAME: crazy-stairway-tennis-virginia
#+BEGIN_SRC ipython :session :results value drawer
[cut(a, 1), cut(a, 1, 3), cut(a, 1, None, 2)]
#+END_SRC

#+RESULTS: crazy-stairway-tennis-virginia
:RESULTS:
[[2, 3, 4, 5], [2, 3], [2, 4]]
:END:
